# Brewfile
# Install everything: brew bundle

# Taps
tap "lokalise/cli-2"
tap "manaflow-ai/cmux"
tap "mobile-dev-inc/tap"

# =============================================================================
# Core CLI tools
# =============================================================================
brew "coreutils"
brew "git-delta"          # Better git diffs
brew "gh"                 # GitHub CLI
brew "jq"                 # JSON processor
brew "httpie"             # curl with style
brew "pandoc"             # Document converter

# =============================================================================
# Terminal / Shell
# =============================================================================
brew "tmux"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# =============================================================================
# cmux — terminal multiplexer workflows
# =============================================================================
cask "cmux"

# =============================================================================
# Editor
# =============================================================================
brew "neovim"

# =============================================================================
# Git tools
# =============================================================================
brew "lazygit"            # TUI git client
brew "tig"                # ncurses git browser

# =============================================================================
# Node / JS
# =============================================================================
# nvm is managed separately via script, not brew

# =============================================================================
# Ruby
# =============================================================================
brew "rbenv"
brew "ruby-build"

# =============================================================================
# Java / Android
# =============================================================================
brew "openjdk@17"
cask "zulu@17"
brew "scrcpy"             # Android screen mirror

# =============================================================================
# Mobile Dev
# =============================================================================
brew "cocoapods"
brew "fastlane"
brew "watchman"
brew "mobile-dev-inc/tap/maestro"

# =============================================================================
# Build tools
# =============================================================================
brew "cmake"
brew "autoconf"
brew "automake"
brew "libtool"
brew "pkgconf"
brew "libyaml"
brew "libksba"
brew "openssl@1.1"
brew "zlib"

# =============================================================================
# AI / Audio
# =============================================================================
brew "ffmpeg"
brew "sox"
brew "portaudio"
brew "pipx"

# =============================================================================
# Misc
# =============================================================================
brew "act"                # Run GitHub Actions locally
brew "lokalise/cli-2/lokalise2"

# =============================================================================
# Casks
# =============================================================================
cask "1password-cli"
cask "kap"               # Screen recorder
